{
	"projects": [
		{
			"client": "Bank of America",
			"logo": "boa.png",
			"link": "",
			"actual": false,
			"screens": ["boa1.jpg", "boa2.jpg"],
			"code": ["boa.coffee"],
			"year": 2013,
			"duration": 0,
			"contribution": "<p>Primary maintainer of Bank of America mobile application and online banking simulators for over 2 years. These simulators echo the look and functionality of the production applications and website, while only containing sample data.</p><p>Created a custom framework to support the simulators from scratch in 2014, which drastically cut development time when adding new features and experience flows. During this process the mobile simulator alone went from over 120 MB in size down to less than 3 MB, while increasing the number of flows and functionality.</p><p>The custom framework seeds example data from JSON files, and enables the chaining together of actions, such as: getting the next slide, transition by sliding the new slide in from the left, timing out for 1 second, then getting the next slide, and so on.</p><p>Everything in the simulator is organized into user flows, which makes it easier to replace sections of the simulators as they are updated over the years.</p><p>The simulators are only accessible within the Bank of America network.</p><p>Technologies: HTML, Sass, CoffeeScript, jQuery, JSON, Gulp, SVGs.</p>"
		},{
			"client": "Tasktop",
			"logo": "tasktop.png",
			"link": "https://www.tasktop.com/resources",
			"actual": true,
			"screens": ["tasktop1.jpg", "tasktop2.jpg"],
			"code": [],
			"year": 2015,
			"duration": 2,
			"contribution": "<p>Launched in late May of 2015, this is a Drupal site that was built to replace the client’s previous site. One item they wanted to improve, was to make it easier for visitors to find resources related to their products and questions.</p><p>I was responsible for creating that searching and filtering mechanism to enable this. The feature, which can be accessed at <a href=\"http://tasktop.com/resources\">Tasktop Resources</a>, gets it’s data from a rendered JSON file, and then handles all the filtering, sorting, and text searching within the browser.</p><p>When the resource is a video, the logic can take any youtube link, or embed code, and generate the appropriate iFrame.</p><p>Technologies: HTML, Sass, TypeScript, JSON, Drupal.</p>"
		},{
			"client": "HealthSource RI",
			"logo": "hsri.png",
			"link": "http://www.healthsourceri.com/",
			"actual": true,
			"screens": ["hsri1.jpg", "hsri2.jpg"],
			"code": [],
			"year": 2014,
			"duration": 4,
			"contribution": "<p>Health Source RI is the entry portal to Rhode Islands healthcare exchange, and I was a member of the team that created the version that is currently in use. The goal of the current release was to make the wealth of information available on the site easier to access and interact with. To this end, the UX designers came up with a few handy tools, which I implemented.</p><p>My primary responsibility was the JavaScript interactions on their main detail pages. These pages and their content appears in the main navigation, making it possible to deep link not only to a page, but to a specific section or resource within a page.</p><p>I was also asked to implement the scroll progress indicator on the right, and the interactions with FAQs and the resources bar at the bottom.</p><p>Technologies: HTML, Sass, CoffeeScript, jQuery, Wordpress.</p>"
		},{
			"client": "D'Angelo",
			"logo": "dangelo.png",
			"link": "http://www.dangelos.com/",
			"actual": true,
			"screens": ["dangelo1.jpg", "dangelo2.jpg"],
			"code": [],
			"year": 2014,
			"duration": 3,
			"contribution": "<p>My team was hired to be part of the group to rebuild D’Angelo’s online presence. We were involved prior to the design phase, during which I created an interactive wire-framed site to demo the possible functionality of the menu and the locations pages.</p><p>As is my practice, these wireframes were created directly in HTML, CSS, and JavaScript, which allowed them to be responsive and interactive. During this, the interactions were refined with feedback, before the designers than took those wireframes and created the designs to match. The end result is D’Angelo’s current site, where I assisted during the main development as well.</p><p>Technologies: HTML, Sass, CoffeeScript, jQuery, JSON, Nunjucks.</p>"
		},{
			"client": "Whoop",
			"logo": "whoop.png",
			"link": "http://whoop.com",
			"actual": false,
			"screens": ["whoop1.jpg", "whoop2.jpg"],
			"code": [],
			"year": 2014,
			"duration": 1,
			"contribution": "<p>Whoop is creating an as yet unreleased wearable. Prior to the launch being delayed, I was responsible for creating an interactive section of what was going to be their new home page. This section featured a 360 degree view of the wearable, which could rotate to specific angles based on which section of the story the visitor was interacting with.</p><p>The story section had multiple text and image layers that would also animate in and out of the stage, while the bracelet rotated, which than needed to line up with specific parts of the bracelet. And all of this had to work responsively.</p><p>Link is the current temporary landing page, awaiting device launch.</p><p>Technologies: HTML, Sass, CoffeeScript, jQuery, Drupal.</p>"
		},{
			"client": "MonarqRC RDS",
			"logo": "rds.png",
			"link": "https://www.monarqrc.com/about-rds",
			"actual": false,
			"screens": [],
			"code": [],
			"year": 2014,
			"duration": 4,
			"contribution": "<p>RDS is a meal management application used by hospitals to schedule and deliver meals to their patients. During the rollout I was involved with transferring data from the prior application, to the current RDS application. This involved customizing a Python script, which took data from rendered JSON files, imported them to a temporary SQLite database, completed multiple transformations, and finally exported the data into the new PostgreSQL database.</p><p>Technologies: Python, JSON, SQLite, PostgerSQL.</p>"
		},{
			"client": "Isles of Shoals",
			"logo": "iossc.png",
			"link": "https://islesofshoals.com/",
			"actual": true,
			"screens": ["iossc1.jpg", "iossc2.jpg"],
			"code": [],
			"year": 2014,
			"duration": 6,
			"contribution": "<p>The Isles of Shoals website, completed mid 2014, is not only a customer facing website, that allows people to purchase tickets, it is also part of their business back end. During it’s development, I was primarily responsible for building all the interactions surrounding the calendars.</p><p>There ended up being 5 distinct versions of the calendar, which appeared in different locations on the customer accessible part, as well as the cruise planning, and sales sections of the admin interface. Each of these versions uses a common library I created for the project, and have modified to use in other projects since.</p><p>Technologies: HTML, Sass, CoffeScript, jQuery, Python, Flask.</p>"
		},{
			"client": "John Hancock Online Enrollment Experience",
			"logo": "jhoee.png",
			"link": "https://www.jhgoenroll.com/",
			"actual": true,
			"screens": ["jhoee.jpg"],
			"code": [],
			"year": 2014,
			"duration": 2,
			"contribution": "<p>Joining the team late, after the client had multiple failed development cycles to get their online enrollment experience completed, I was responsible for resolving multiple issues in this complex Angular.js application. Most of the issues were browser specific, Internet Explorer 8, and involved issues with video formats, as well as a multitude of other errors. After a few weeks, myself and 3 other developers were able to get it stable enough to be launched.</p><p>Technologies: HTML, JavaScript, Angular.js, Web Video.</p>"
		},{
			"client": "Versatile",
			"logo": "versatile.png",
			"link": "http://weareversatile.com/",
			"actual": true,
			"screens": ["versatile.jpg"],
			"code": [],
			"year": 2014,
			"duration": 4,
			"contribution": "<p>Part of the brand update for Versatile, I was the main front-end resource to create their new website. One major feature was an animated and responsive hero section. This section featured multiple image and text layers that had to move based on user action, and also respond correctly to any device size.</p><p>Technologies: HTML, Sass, CoffeeScript, jQuery, Kentico, .NET, C#.</p>"
		},{
			"client": "Koko Fitclub",
			"logo": "koko.png",
			"link": "http://kokofitclub.com/",
			"actual": false,
			"screens": ["koko1.jpg", "koko2.jpg"],
			"code": [],
			"year": 2013,
			"duration": 4,
			"contribution": "<p>During a major marketing update for Koko Fitclub, I was the main developer responsible for creating the experience for their new site. Part of the designs were story components that usually paired an image with some text. The client wanted a dotted line to connect this elements switching side to side. Each of these story elements needed to be fully editable within Drupal, so the path needed to be editable as well.</p><p>On the story items, there were a serious of drop-downs that controlled this line. They would say if the line should go through the left side, the right side, or if it started or ended at that story element. I then created a script that would look at these inputs, and using Bezier curves to connect the control points. Finally, for some variety, I made the length of the control lines vary randomly to created an interesting and path down the page.</p><p>Update, the dynamic path is not currently featured on the live site, as Koko Fitclub has replaced the entire site with a static version, while the client builds out a new Ruby on Rails backend.</p><p>Technologies: HTML, Sass, CoffeeScript, jQuery, Drupal.</p>"
		},{
			"client": "Bertucci's",
			"logo": "bertuccis.png",
			"link": "http://www.bertuccis.com/",
			"actual": true,
			"screens": ["bertuccis.jpg"],
			"code": [],
			"year": 2013,
			"duration": 4,
			"contribution": "<p>I was part of the team to build the current version on Bertucci’s website. We were brought in early, so I was responsible for creating interactive wireframes to demo the possible menu interaction, as well as the location finder featured in the header.</p><p>These wireframes were created directly in HTML, CSS, and JavaScript, which made it possible to have responsive and interactive wireframes for the client to give feedback on. Once those were approved, the designers used those wireframes as guides to create the final design.</p><p>Finally, I contributed to the main site development by implementing the location interactive features. Including getting the device location, finding relevant restaurants, and allowing the visitor to save their favorite restaurant. That favorite restaurant is then featured in the header, so the user always has easy access to that restaurants hours and location.</p><p>Technologies: HTML, Sass, CoffeeScript, jQuery, Drupal.</p>"
		},{
			"client": "TrackMyTrainer",
			"logo": "trackmytrainer.png",
			"link": "http://trackmytrainer.com/",
			"actual": false,
			"screens": ["tmt.jpg"],
			"code": [],
			"year": 2013,
			"duration": 4,
			"contribution": "<p>TrackMyTrainer is an web based mobile application that was in development to allow people to follow their personal trainer. I was responsible for creating the initial UX flows in Keynote, as well as some of the early designs. Later I assisted with some of the front-end development.</p><p>Technologies: HTML, Sass, CoffeeScript, PhotoShop, Keynote.</p>"
		}
	],
	"code": [
		{
			"name": "Bertucci's Locations",
			"file": "bertuccis.txt",
			"lang": "coffee",
			"description": "Part of the logic on the Bertucci's website that allows a guest to find and select a favorite a location which the browser remembers on subsequent visits. This also makes the relevant information about that location easy to access from anywhere on the site."
		},{
			"name": "BoA Controller",
			"file": "boa.txt",
			"lang": "coffee",
			"description": "The goal was to make it very easy to create complex behaviors from simple behaviors. This controller makes it possible to chain small actions into a callback driven sequence based on the need of the screen."
		},{
			"name": "Dangelo's Template",
			"file": "dangelo.txt",
			"lang": "html",
			"description": "Template for the Dangelo's UX Prototype, which utilizes Nunjucks for the templating engine."
		},{
			"name": "Dangelo's Style",
			"file": "dangelo_style.txt",
			"lang": "scss",
			"description": "Styles used during the creation of the Dangelo's UX Prototype. Uses flexbox to control the layout."
		},{
			"name": "Path Movement Renderer",
			"file": "dots.txt",
			"lang": "javascript",
			"description": "Part of the path dots code challenge, this is the render that creates the board. The dots are placed using the canvas, while the paths are built up as SVGs."
		},{
			"name": "Path Movement Board",
			"file": "dots2.txt",
			"lang": "javascript",
			"description": "This section creates the board, and sets random directions for every dot on the board. That board can then be navigated by pieces."
		},{
			"name": "HealthSource RI Scroll",
			"file": "hsri.txt",
			"lang": "coffee",
			"description": "On the primary content pages, this controls the scroll progress indicator on the right side of the page. It acts as a secondary navigation, and visually communicates where the read is."
		},{
			"name": "HealthSoure RI Style",
			"file": "hsri_style.txt",
			"lang": "scss",
			"description": "On the same page that has the scroll behavior, this is part of the styles that control a highly nested page. Many styles are different, depending on how deeply they are nested."
		},{
			"name": "IOSSC Calendar",
			"file": "iossc.txt",
			"lang": "coffee",
			"description": "General calendar functionality used for a number of projects, but first created for the scheduling calendar on the Isles of Shoals website."
		},{
			"name": "Koko Paths",
			"file": "koko.txt",
			"lang": "coffee",
			"description": "The client wanted to feature a story on their main page that connected the story items by dots. This path had to be editable within the Content Management System and work responsively. When the main page loads, the code scans the elements for where in the element the path should go, then creates a path with random variations to connect the points using Bezier curves."
		},{
			"name": "Koko Style",
			"file": "koko_style.txt",
			"lang": "scss",
			"description": "Part of the same section as the path generator, these styles allow significant customization of a story using the Content Management System."
		},{
			"name": "List Operations",
			"file": "listops.txt",
			"lang": "haskell",
			"description": "<a href=\"http://exercism.io/\">Exercism</a> problem solution for basic list manipulation functions."
		},{
			"name": "Content Nav Model",
			"file": "marshallworks.txt",
			"lang": "ruby",
			"description": "Model for content navigation data used on a previous version of this site."
		},{
			"name": "People Controller",
			"file": "squire_go.txt",
			"lang": "go",
			"description": "Personal project controller written in Go and using MonogDB."
		},{
			"name": "Accounts Controller",
			"file": "squire_python.txt",
			"lang": "python",
			"description": "Personal project controller written in Python and using PostgreSQL."
		},{
			"name": "General Functionality",
			"file": "symmetry.txt",
			"lang": "javascript",
			"description": "Various page functionality for a client website, written in VanillaJS."
		},{
			"name": "Tasktop Resource Filtering",
			"file": "tasktop.txt",
			"lang": "typescript",
			"description": "The client had a large number of resources, which had been difficult for people to sift through, and find what they were looking for. During the development of their new site, I created a filtering and search feature that enabled them to filter by: Product, Resource Type, Topic, and even text search. The server provides a rendered JSON file, and the rest is handled in browser."
		},{
			"name": "Versatile Animation",
			"file": "versatile.txt",
			"lang": "coffee",
			"description": "The designer for Versatile had a concept for the hero section of the site. It involved movement of multiple layers and had to work differently depending on screen size."
		},{
			"name": "Versatile Animation Styles",
			"file": "versatile_style.txt",
			"lang": "scss",
			"description": "The styles that work in conjunction with the JavaScript animation to create the hero experience."
		},{
			"name": "Whoop 360 Animation",
			"file": "whoop.txt",
			"lang": "coffee",
			"description": "Un-released complex page animation that included a rendering of a bracelet that rotated in full 360 degrees, and would rotate to specific positions based on the scroll position and content slide."
		}
	],
	"images": [
		{
			"title": "",
			"description": "",
			"file": "090801CreatureWreck.jpg"
		},{
			"title": "",
			"description": "",
			"file": "BananaMonster.jpg"
		},{
			"title": "Boiler Room",
			"description": "Boiler room inside a steam-punk ship. Created using 3ds Max, Zbrush, and Photoshop.",
			"file": "Boiler_Gray.jpg"
		},{
			"title": "",
			"description": "",
			"file": "Boiler_View1.jpg"
		},{
			"title": "",
			"description": "",
			"file": "Boiler_View3.jpg"
		},{
			"title": "",
			"description": "",
			"file": "F16_Danger_Areas.jpg"
		},{
			"title": "",
			"description": "",
			"file": "FighterCharacters.jpg"
		},{
			"title": "",
			"description": "",
			"file": "FighterDesign.jpg"
		},{
			"title": "",
			"description": "",
			"file": "HeadSculp.jpg"
		},{
			"title": "",
			"description": "",
			"file": "Jolly_Humor.jpg"
		},{
			"title": "",
			"description": "",
			"file": "MMTromp.jpg"
		},{
			"title": "",
			"description": "",
			"file": "Minotaur_Tech.jpg"
		},{
			"title": "",
			"description": "",
			"file": "Minotaur_Tech_Model.jpg"
		},{
			"title": "",
			"description": "",
			"file": "MonsterCol.jpg"
		},{
			"title": "",
			"description": "",
			"file": "NewBoss.jpg"
		},{
			"title": "",
			"description": "",
			"file": "Newman.jpg"
		},{
			"title": "",
			"description": "",
			"file": "P-51.jpg"
		},{
			"title": "",
			"description": "",
			"file": "RedHand.jpg"
		},{
			"title": "",
			"description": "",
			"file": "SloberMonster.jpg"
		},{
			"title": "",
			"description": "",
			"file": "Still.jpg"
		},{
			"title": "",
			"description": "",
			"file": "TheEvent.jpg"
		},{
			"title": "",
			"description": "",
			"file": "UhntDesignSketch.jpg"
		},{
			"title": "",
			"description": "",
			"file": "UhntFullModel.jpg"
		},{
			"title": "",
			"description": "",
			"file": "UhntGameModel.jpg"
		}
	],
	"skills": [
		{
			"title": "HTML5",
			"level": 5,
			"tags": ["frontend"]
		},{
			"title": "CSS3",
			"level": 5,
			"tags": ["frontend"]
		},{
			"title": "JavaScript",
			"level": 5,
			"tags": ["frontend"]
		},{
			"title": "Python",
			"level": 3,
			"tags": ["backend"]
		},{
			"title": "Go",
			"level": 1,
			"tags": ["backend"]
		},{
			"title": "Sass",
			"level": 5,
			"tags": ["frontend", "style"]
		},{
			"title": "Haskell",
			"level": 2,
			"tags": ["backend", "functional"]
		},{
			"title": "MongoDB",
			"level": 2,
			"tags": ["backend", "database", "nosql"]
		}
	]
}
